app/views/book/edit.html.erb

<p>Price: <%= f.text_field  'price' %></p>
<p>Subject: <%= f.collection_select :subject_id, Subject.all, :id, :name %></p>
---
SELECT "subjects".* FROM "subjects"