app/controllers/articles_controller.rb

    def create
        # render plain: params[:article].inspect
        # @article = Article.new(params.require(:article).permit(:title,:text))
        @article = Article.new(article_params)

        if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "security"], ["text", "checkdsfdsgdgv"], ["created_at", "2019-06-25 12:26:02.888687"], ["updated_at", "2019-06-25 12:26:02.888687"]]