app/controllers/book_controller.rb

    def list
        @books = Book.all
---
SELECT "books".* FROM "books"

    def new
        @book = Book.new
        @subjects = Subject.all
---
SELECT "subjects".* FROM "subjects"

    def create
        @book = Book.new(book_params)

        if @book.save
            redirect_to :action => 'list'
        else
            @subjects = Subject.all
---
INSERT INTO "books" ("title", "price", "subject_id", "description", "created_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Advance Physics"], ["price", 395.0], ["subject_id", 1], ["description", "This is a test to create a new book."], ["created_at", "2019-06-26 08:49:24.735653"]]
SELECT "subjects".* FROM "subjects"

    def edit
        @book = Book.find(params[:id])
        @subjects = Subject.all
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "subjects".* FROM "subjects"

    def update
        @book = Book.find(params[:id])

        if @book.update_attributes(book_param)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "description" = $1 WHERE "books"."id" = $2  [["description", "Physics book........"], ["id", 3]]

    def delete
        Book.find(params[:id]).destroy
---
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def show_subjects
        @subject = Subject.find(params[:id])
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]